
## Plan Result




<pre><code>Plan: 1 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.et-pet-api-redis-url
* Update
  * module.et-api-database.azurerm_postgresql_server.postgres-paas
  * module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.et1-database.azurerm_postgresql_server.postgres-paas
  * module.et3-database.azurerm_postgresql_server.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.et-pet-api-redis-url will be created
  + resource "azurerm_key_vault_secret" "et-pet-api-redis-url" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat"
      + name                    = "et-pet-api-redis-url"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.et-api-database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-api-data-aat/providers/Microsoft.DBforPostgreSQL/servers/et-pet-api-aat"
        name                              = "et-pet-api-aat"
        tags                              = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.et-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-aat/providers/Microsoft.KeyVault/vaults/et-pet-aat|et-pet-aat"
        name                       = "et-pet-aat"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.et1-database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-et1-data-aat/providers/Microsoft.DBforPostgreSQL/servers/et-pet-et1-aat"
        name                              = "et-pet-et1-aat"
        tags                              = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

  # module.et3-database.azurerm_postgresql_server.postgres-paas will be updated in-place
  ~ resource "azurerm_postgresql_server" "postgres-paas" {
        id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/et-pet-et3-data-aat/providers/Microsoft.DBforPostgreSQL/servers/et-pet-et3-aat"
        name                              = "et-pet-et3-aat"
        tags                              = {
            "application"         = "et-pet"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/et-pet-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "staging"
            "managedBy"           = "Employment Tribunals PET"
        }
        # (16 unchanged attributes hidden)

      - threat_detection_policy {
          - disabled_alerts      = [] -> null
          - email_account_admins = false -> null
          - email_addresses      = [] -> null
          - enabled              = true -> null
          - retention_days       = 0 -> null
        }
    }

Plan: 1 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":5,"Program":"tfcmt","SHA1":"","Vars":{}} -->